/**************************************************************
** 	啟航號開發板
**	ASCII碼字庫及漢字自定義字庫的應用
**  版本：V1.0  
**	論壇：www.openmcu.com
**	淘寶：http://shop36995246.taobao.com/   
**  技術支持群：77642732 
***************************************************************/

#ifndef __HZ16_H
#define __HZ16_H
#include "stm32f10x.h"


/*********************************************************************************************************
漢字字模的數據結構定義
*********************************************************************************************************/
typedef struct typefnt{                                                 /* 漢字字模數據結構             */
    unsigned char Index[2];                                             /* 漢字內碼索引                 */
    unsigned char Msk[32];                                              /* 點陣碼數據                   */
}FNT_GB16;

extern const FNT_GB16 GBHZ_16[];                                        /* 自定義漢字字庫               */
extern const unsigned char ASCII[][16];                                 /* 自定義ASCII字庫              */

extern uint16_t findHzIndex(uint8_t *hz);                               /* 在自定義漢字庫在查找所要顯示 */
                                                                        /* 的漢字的區位                 */

#endif
/*********************************************************************************************************
** End of File
*********************************************************************************************************/
