/**************************************************************
** 	啟航號開發板
**	ASCII碼字庫及漢字自定義字庫的應用
**  版本：V1.0  
**	論壇：www.openmcu.com
**	淘寶：http://shop36995246.taobao.com/   
**  技術支持群：121939788 
***************************************************************/
#include "hz16.h"

/*****************************************************************************
** 函數名稱: findHzIndex
** 功能描述: 查找漢字在自定義字庫中的索引
				hz 指向漢字(機內碼)的指針
** 作  　者: Dream
** 日　  期: 2010年12月06日
*****************************************************************************/
uint16_t findHzIndex(uint8_t *hz)                     /* 在自定義漢字庫在查找所要顯示 */
                                                      /* 的漢字的位置 */
{
    uint16_t i=0;
    
    FNT_GB16 *ptGb16 = (FNT_GB16 *)GBHZ_16;
    
    while(ptGb16[i].Index[0] > 0x80) {
        if ((*hz == ptGb16[i].Index[0]) && (*(hz+1) == ptGb16[i].Index[1])) 
		{
            return i;
        }
        i++;
        if(i > (sizeof((FNT_GB16 *)GBHZ_16) / sizeof(FNT_GB16) - 1))  /* 搜索下標約束 */
        {
		    break;
        }
    }
    return 0;
}

/*********************************************************************************************************
** End of File
*********************************************************************************************************/
